In [2]:
import pandas as pd
import numpy as np

In [4]:
ser=pd.Series(np.arange(10), index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [5]:
ser

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int32

In [6]:
ser['a':'f']

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [7]:
ser['e', 'i', 'a']

KeyError: 'key of type tuple not found and not a MultiIndex'

In [8]:
ser[ser<7]

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int32

In [9]:
ser['b':'d']=[19, 7, 87]

In [10]:
ser.iloc[5]

5

In [ ]:
#Create a pandas Series 'ser' with values from 0 to 9 and the with the index 'a' to 'j'. 
#Filter the series for the index 'f'. Try accessing the element on two ways.

In [11]:
ser=pd.Series(np.arange(10), index =['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'])
ser

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [12]:
ser1=pd.Series(np.arange(10), index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
ser1

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int32

In [13]:
ser1[f]

NameError: name 'f' is not defined

In [14]:
ser1.iloc[8]

8

In [18]:
ser2=ser1[ser1<7]
ser2

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int32

In [20]:
#Print the values four to seven from 'ser'
ser1['e':'h']

e    4
f    5
g    6
h    7
dtype: int32

In [25]:
#ser1[ser1>4, ser1>7]

In [ ]:
#riverDf.set_index('river')
#riverDf.reset_index()

In [21]:
#Print the values of the indexes 'e','i','c' and 'j'
ser1['e','i','c','j']

KeyError: 'key of type tuple not found and not a MultiIndex'

In [22]:
#Print the values 'g' to 'i'
ser1['g':'i']

g    6
h    7
i    8
dtype: int32

In [ ]:
####

In [26]:
data=pd.DataFrame(np.random.randint(1,100,9).reshape((3,3)),
                  index=['New York', 'Berlin', 'Dakar'],
                  columns=['one', 'two', 'three'])
data

          one  two  three
New York   57   52     97
Berlin     27   84     91
Dakar      50    1     97

In [27]:
data[['two', 'three']]

          two  three
New York   52     97
Berlin     84     91
Dakar       1     97

In [28]:
data[data['one']>36]

          one  two  three
New York   57   52     97
Dakar      50    1     97

In [29]:
data>40

            one    two  three
New York   True   True   True
Berlin    False   True   True
Dakar      True  False   True

In [30]:
data.loc['Berlin', 'three']

91

In [31]:
data.iloc[[1,2], [0,2]]

        one  three
Berlin   27     91
Dakar    50     97

In [32]:
data.sort_index(axis=0)

          one  two  three
Berlin     27   84     91
Dakar      50    1     97
New York   57   52     97

In [33]:
data.sort_index(axis=1)

          one  three  two
New York   57     97   52
Berlin     27     91   84
Dakar      50     97    1

In [34]:
data.sort_values(by='one')  #values sorted low to high

          one  two  three
Berlin     27   84     91
Dakar      50    1     97
New York   57   52     97

In [35]:
data.sort_values(by=['two', 'one'])

          one  two  three
Dakar      50    1     97
New York   57   52     97
Berlin     27   84     91

In [36]:
#Print the columns 'one' and 'four' from the dataframe 'df'
df = pd.DataFrame(np.random.randint(1, 81 ,16).reshape((4,4)),index =['Kap Verde', 'Fidschi', 'Skye', 'Hawaii'], 
                     columns=['one','two','three','four'])

In [37]:
df

           one  two  three  four
Kap Verde   57    4      9    39
Fidschi     17    5     28    10
Skye         4   21     52    71
Hawaii      37   67     27    19

In [38]:
df[['one', 'four']]

           one  four
Kap Verde   57    39
Fidschi     17    10
Skye         4    71
Hawaii      37    19

In [41]:
#Only print the Rows which have values greater than 30 in column 'two'
df[df['two']>30]

        one  two  three  four
Hawaii   37   67     27    19

In [40]:
#Create a boolean table which returns True for values greater than '10'
df>10

             one    two  three   four
Kap Verde   True  False  False   True
Fidschi     True  False   True  False
Skye       False   True   True   True
Hawaii      True   True   True   True

In [45]:
#Print the element from 'df' that is in row 'Fidschi' and in column 'four'
df.loc['Fidschi', 'four']

10

In [48]:
#Print all elements of 'df' that are in the rows 'Fidschi' and 'Skye' and in the columns 'one' and 'four'
df.iloc[[1,2], [0,3]]

         one  four
Fidschi   17    10
Skye       4    71

In [50]:
#Print all elements of 'df' in row 1 and 2 and in column 0 and 3
df.iloc[[0,1], [0,3]]

           one  four
Kap Verde   57    39
Fidschi     17    10

In [51]:
#Sort 'df' after the row index
data.sort_values(by='0')

KeyError: '0'

In [ ]:
#Sort 'df' after the column index

In [ ]:
#Sort 'df' after the values in column 'three'

In [ ]:
#Sort 'df' first after the values in colum 'three' and then after column 'one'

In [53]:
#
df1=pd.DataFrame(np.arange(9).reshape((3,3)), columns=list('abc'), index=['Theo','Bert','Stephan'])

df2=pd.DataFrame(np.random.randint(1, 20, 9).reshape((3,3)),columns=list('abc'), index=['Theo', 'Robert', 'Stephan'])

In [54]:
df1 + df2

            a     b     c
Bert      NaN   NaN   NaN
Robert    NaN   NaN   NaN
Stephan  10.0  22.0  24.0
Theo     19.0  18.0   4.0

In [57]:
df1.add(df2, fill_value=0)

            a     b     c
Bert      3.0   4.0   5.0
Robert    2.0   4.0  10.0
Stephan  10.0  22.0  24.0
Theo     19.0  18.0   4.0

In [56]:
df1

         a  b  c
Theo     0  1  2
Bert     3  4  5
Stephan  6  7  8

In [58]:
df3=df1.add(df2, fill_value=0)
df3

            a     b     c
Bert      3.0   4.0   5.0
Robert    2.0   4.0  10.0
Stephan  10.0  22.0  24.0
Theo     19.0  18.0   4.0

In [59]:
df3 = df3 - df3.loc['Bert']
df3

            a     b     c
Bert      0.0   0.0   0.0
Robert   -1.0   0.0   5.0
Stephan   7.0  18.0  19.0
Theo     16.0  14.0  -1.0

In [60]:
f = lambda x: x + 20
df3.apply(f, axis=0)

            a     b     c
Bert     20.0  20.0  20.0
Robert   19.0  20.0  25.0
Stephan  27.0  38.0  39.0
Theo     36.0  34.0  19.0

In [61]:
#Add 'frame1' and 'frame2'. Check the 'NaN'-Values
frame1 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Skye', 'Fidschi', 'Hawaii'])

frame2 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Skye', 'Kap Verde', 'Fidschi'])

In [62]:
frame1 + frame2

             b     c     d
Fidschi    9.0  11.0  13.0
Hawaii     NaN   NaN   NaN
Kap Verde  NaN   NaN   NaN
Skye       0.0   2.0   4.0

In [66]:
#Add the two dataframes using the add() function and fill missing values with '0' and save it in 'frame3'
frame3 = frame1.add(frame2, fill_value=0)
frame3

             b     c     d
Fidschi    9.0  11.0  13.0
Hawaii     6.0   7.0   8.0
Kap Verde  3.0   4.0   5.0
Skye       0.0   2.0   4.0

In [67]:
#Subtract the row with the index 'Fidschi' from 'frame3' from all elements in 'frame3' and save it in 'frame4'
frame4 = frame3 - frame3.loc['Fidschi']
frame4

             b    c    d
Fidschi    0.0  0.0  0.0
Hawaii    -3.0 -4.0 -5.0
Kap Verde -6.0 -7.0 -8.0
Skye      -9.0 -9.0 -9.0

In [69]:
#Convert all values of 'frame5' to positive numbers
frame5 = pd.DataFrame({'a':[0.234,-1.432,6.753,-9.653],'b':[2.521,-4.349,5.323,4.024],'c':[0.231,-0.986,3.821,-7.424]}
                      , index=['one','two','three','four'])
frame5

           a      b      c
one    0.234  2.521  0.231
two   -1.432 -4.349 -0.986
three  6.753  5.323  3.821
four  -9.653  4.024 -7.424

In [71]:
frame6=frame5 + 10.000
frame6

            a       b       c
one    10.234  12.521  10.231
two     8.568   5.651   9.014
three  16.753  15.323  13.821
four    0.347  14.024   2.576

In [72]:
fpos = lambda x<0: x * (-1)
frame5.apply(fpos, axis=0)
frame5

SyntaxError: invalid syntax (956127413.py, line 1)

In [ ]:
data = pd.read_csv('AppBewertungen.csv', sep = ';')

In [ ]:
data_without_header

In [ ]:
data1 = pd.read_csv('AppBewertungen.csv', sep = ';', header = None)
data1

In [73]:
data2 = pd.read_csv('AppBewertungen.csv', sep = ';', index_col='Datum')
data2

FileNotFoundError: [Errno 2] No such file or directory: 'AppBewertungen.csv'

In [ ]:
data2.drop([' Land'], axis = 0)
data2.head()